RIET/src/DataProcessors/ImportExportTests/ImportExportTests.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ImportExportTests</name>
</mdclass:DataProcessor>

RIET/src/Enums/TypesOfCustomsFileLightTransaction/TypesOfCustomsFileLightTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfCustomsFileLightTransaction</name>
  <enumValues>
    <name>CustomsFileLight</name>
  </enumValues>
  <enumValues>
    <name>ТПО</name>
  </enumValues>
  <enumValues>
    <name>CustomsBond</name>
  </enumValues>
  <enumValues>
    <name>CustomsBondClosing</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/Инвойс/Инвойс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвойс</name>
  <attributes>
    <name>Голд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Декларант</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.Incoterms</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>OperatingLocation</name>
    <type>
      <types>CatalogRef.OperatingLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаДоставку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страховка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SkipSomeChecks</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DSSNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АрхивИмпортЭкспорт</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬГрузополучатель</name>
    <type>
      <types>CatalogRef.УДАЛИТЬDeliverTo</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬПолноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Transfer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PayingEntity</name>
    <type>
      <types>EnumRef.PayingEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/Documents/КонсолидированныйПакетЗаявокНаПеревозку/КонсолидированныйПакетЗаявокНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонсолидированныйПакетЗаявокНаПеревозку</name>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <attributes>
    <name>ИмпортЭкспорт</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>GOLD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectlyToTheHub</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsignTo</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Seller</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>MOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </attributes>
  <attributes>
    <name>RequestedPOA</name>
    <type>
      <types>CatalogRef.SeaAndAirPorts</types>
    </type>
  </attributes>
  <attributes>
    <name>Urgency</name>
    <type>
      <types>EnumRef.Urgencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВажности</name>
    <type>
      <types>EnumRef.СтатусыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Requested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accepted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCAFirstResponse</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Granted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Booked</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStage</name>
    <type>
      <types>EnumRef.DOCStages</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStatus</name>
    <type>
      <types>EnumRef.DOCStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStatusDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WithoutGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HouseKeeping</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentComment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>650</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>SegmentsList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SanctionedItems</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PendingEUC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PermitsRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>COORequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>FormalGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteeLetterRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>SentToTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SentToTMSDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceLocation</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionSpecialist</name>
    <type>
      <types>CatalogRef.SLSRCA</types>
    </type>
  </attributes>
  <attributes>
    <name>SubmittedByTransactionSpecialist</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>GL_FromSegment</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCAReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCA_Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ReRoute</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfLines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfUniqueLines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Инвойсы</name>
    <attributes>
      <name>Инвойс</name>
      <type>
        <types>DocumentRef.Инвойс</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ManualStatuses</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>EnumRef.DOCStatuses</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Version</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TMS_OB</name>
    <attributes>
      <name>OBNo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ApprovalBorgs</name>
    <attributes>
      <name>Borg</name>
      <type>
        <types>CatalogRef.BORGs</types>
      </type>
    </attributes>
    <attributes>
      <name>Approve</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ApproveDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TNVEDCodesOfBroker</name>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.Инвойс</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>TNVEDBroker</name>
      <type>
        <types>CatalogRef.TNVEDCodes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/DataProcessors/ImportExportTests/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗапуститьТестирование(Команда)
	 	   	      	
	МассивСтруктурФормИУсловий = ПолучитьМассивСтруктурФормИУсловий();
	
	ЗапуститьТестированиеОбъектов(МассивСтруктурФормИУсловий);	
			
	Предупреждение("Тестирование завершено.");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивСтруктурФормИУсловий()
	
	МассивСтруктурФормИУсловий = Новый Массив;
	
	// ОБЩИЕ ФОРМЫ
	
	ДобавитьФорму(МассивСтруктурФормИУсловий, "ОбщаяФорма", "ImportExportSpecialistDesktop");
	
	ДобавитьФорму(МассивСтруктурФормИУсловий, "ОбщаяФорма", "RegistrationInImportExportTracking");
	
	
	// СПРАВОЧНИКИ
	
	// Parcels
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Справочник.Parcels", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Справочник.Parcels", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Справочник.Parcels", "ФормаОбъекта", "Проверен");	
	
	// Items
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Справочник.СтрокиИнвойса", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Справочник.СтрокиИнвойса", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Справочник.СтрокиИнвойса", "ФормаОбъекта", "Final");
	
	
	// ДОКУМЕНТЫ
	
	// Import invoices
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.Инвойс", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.Инвойс", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.Инвойс", "ФормаОбъекта", "Проведен, Голд = Ложь");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.Инвойс", "ФормаОбъекта", "Проведен, Голд");
          		
	// DOCs
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.КонсолидированныйПакетЗаявокНаПеревозку", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.КонсолидированныйПакетЗаявокНаПеревозку", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.КонсолидированныйПакетЗаявокНаПеревозку", "Форма.ФормаОтправкиПочтовогоСообщения");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.КонсолидированныйПакетЗаявокНаПеревозку", "ФормаОбъекта", "Проведен, GOLD");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.КонсолидированныйПакетЗаявокНаПеревозку", "ФормаОбъекта", "Проведен, GOLD = Ложь");
	
	// Import shipments
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.Поставка", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.Поставка", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.Поставка", "ФормаОбъекта", "Проведен, GOLD = Ложь");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.Поставка", "ФормаОбъекта", "Проведен, GOLD");

	// ILMs
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ЗакрытиеПоставки", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ЗакрытиеПоставки", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ЗакрытиеПоставки", "ФормаОбъекта", "Проведен"); 
	
	// Customs files
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ГТД", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ГТД", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ГТД", "ФормаОбъекта", "Проведен");
	
	// ILCs
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.InvoiceLinesClassification", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.InvoiceLinesClassification", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.InvoiceLinesClassification", "ФормаОбъекта", "Проведен");
	
	// Customs files light
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.CustomsFilesLight", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.CustomsFilesLight", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.CustomsFilesLight", "Форма.ФормаПодбораItems", , ПолучитьСтруктуруПараметровФормыПодбораItems());
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.CustomsFilesLight", "ФормаОбъекта", "Проведен");
	
	// Export requests
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ExportRequest", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ExportRequest", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ExportRequest", "ФормаОбъекта", "ПометкаУдаления = Ложь");
	
	// Export shipments
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ExportShipment", "ФормаСписка");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ExportShipment", "ФормаВыбора");
	ДобавитьФорму(МассивСтруктурФормИУсловий, "Документ.ExportShipment", "ФормаОбъекта", "ПометкаУдаления = Ложь");
	
	Возврат МассивСтруктурФормИУсловий;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруПараметровФормыПодбораItems()
	
	ПараметрыФормы = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CustomsFilesLightItems.Ссылка,
				   |	CustomsFilesLightItems.Ссылка.ImportExport,
	               |	CustomsFilesLightItems.Ссылка.SoldTo,
	               |	CustomsFilesLightItems.Ссылка.PermanentTemporary,
	               |	CustomsFilesLightItems.Ссылка.PSAContract,
	               |	CustomsFilesLightItems.Ссылка.Shipment
	               |ИЗ
	               |	Документ.CustomsFilesLight.Items КАК CustomsFilesLightItems
	               |ГДЕ
	               |	CustomsFilesLightItems.Ссылка.Проведен
	               |	И CustomsFilesLightItems.Item <> ЗНАЧЕНИЕ(Справочник.СтрокиИнвойса.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ПараметрыФормы.Вставить("TypeOfTransaction", Перечисления.TypesOfCustomsFileLightTransaction.CustomsFileLight);
		ПараметрыФормы.Вставить("ImportExport", Выборка.ImportExport);
		ПараметрыФормы.Вставить("ParentCompany", Выборка.SoldTo);
		ПараметрыФормы.Вставить("PermanentTemporary", Выборка.PermanentTemporary);
		ПараметрыФормы.Вставить("PSAContract", Выборка.PSAContract);
		ПараметрыФормы.Вставить("Shipment", Выборка.Shipment);
		ПараметрыФормы.Вставить("CurrentCustomsFileLight", Выборка.Ссылка);
		ПараметрыФормы.Вставить("CurrentItems", Новый Массив);
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьФорму(Массив, ИмяОбъекта, ИмяОткрываемойФормы, Условие=Неопределено, СтруктураПараметров=Неопределено)
	
	Массив.Добавить(Новый Структура("ИмяОбъекта, ИмяФормы, Условие, СтруктураПараметров", 
				              ИмяОбъекта, ИмяОткрываемойФормы, Условие, ?(СтруктураПараметров = Неопределено, Новый Структура(), СтруктураПараметров)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТестированиеОбъектов(МассивСтруктурФормИУсловий)
	
	Для Каждого СтруктураФормаИУсловие из МассивСтруктурФормИУсловий Цикл 
		
		ИмяОбъекта = СтруктураФормаИУсловие.ИмяОбъекта;
		ИмяОткрываемойФормы = ИмяОбъекта + "." + СтруктураФормаИУсловие.ИмяФормы;
		Условие = СтруктураФормаИУсловие.Условие;
		ПараметрыФормы = СтруктураФормаИУсловие.СтруктураПараметров;
		      		
		Если Условие = Неопределено Тогда 
			
			Форма = ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы);
			Форма.Закрыть();
			
			Продолжить;
			
		КонецЕсли;
		
		МассивКлючей = ПолучитьМассивКлючей(ИмяОбъекта, Условие);
		Для Каждого Ключ из МассивКлючей Цикл
			
			ПараметрыФормы.вставить("Ключ", Ключ);
			
			Форма = ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы);
			Форма.Закрыть();
			
		КонецЦикла;			
		
	КонецЦикла;
	           		
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКлючей(ИмяОбъекта, Условия)
	
	ТекстУсловия = "";
	МассивУсловий = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Условия, ",");
	
	Для Каждого Условие из МассивУсловий Цикл 
		ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = "" , "", " И ") + "Таблица." + СокрЛП(Условие);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 3
	|	Таблица.Ссылка
	|ИЗ
	|	"+ИмяОбъекта+" КАК Таблица
	|ГДЕ "+ТекстУсловия+"
	|";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
